app/Controllers/UserSection/Author/Articles/Guides.php

SELECT *
FROM `guides`
---
    public function index()
    {
        $guideModel = new GuideModel();
        $data['guides'] = $guideModel->findAll();