app/Controllers/UserSection/Author/Articles/News.php

SELECT *
FROM `news`
---
    public function news()
    {
        helper('breadcrumbs');
        $segments = ['Articles', 'News'];
        $data['breadcrumbs'] = generate_breadcrumbs($segments);
        $data['view_name'] = 'News';

        $newModel = new NewModel();
        $data['news'] = $newModel->findAll();