app/Controllers/UserSection/Author/Articles/ViewArticles.php

    public function viewArticles()
    {
        $userModel = new UserModel();
        $articleModel = new ArticleModel();
        $articleTagModel = new ArticleTagModel();
        $tagModel = new TagModel();

        helper('breadcrumbs');
        $segments = ['Articles', 'View'];
        $data['breadcrumbs'] = generate_breadcrumbs($segments);
        $data['view_name'] = 'View Articles';

        $data['articles'] = $articleModel
            ->select('articles.*, first_name as author_name, last_name as author_surname')
            ->join('users', 'articles.author_id = users.id')
            ->where('users.role_id', 2)
            ->findAll();

        foreach ($data['articles'] as &$article) {
            $tagIDs = $articleTagModel->where('article_id', $article['id'])->findColumn('tag_id');
            $article['tags'] = $tagModel->whereIn('id', $tagIDs)->findAll();
---
SELECT `articles`.*, `first_name` as `author_name`, `last_name` as `author_surname`
FROM `articles`
JOIN `users` ON `articles`.`author_id` = `users`.`id`
WHERE `users`.`role_id` = 2
SELECT `tag_id`
FROM `article_tags`
WHERE `article_id` = '1'
SELECT *
FROM `tags`
WHERE `id` IN ('1','2')