app/Controllers/adminController/muController.php

    public function view()
    {
        helper('breadcrumbs');
        $segments = ['Manage Users'];
        $data['breadcrumbs'] = generate_breadcrumbs($segments);
        $data['view_name'] = 'Manage Users';

        // Parámetros de paginación/ordenación
        $perPage = $this->request->getGet('perPage') ?? 5;
        $perPage = in_array($perPage, [5, 10, 15, 20]) ? $perPage : 10;

        $column = $this->request->getGet('column') ?? 'id';
        $order = $this->request->getGet('order') ?? 'asc';

        $allowedColumns = ['id', 'username', 'email', 'role_id', 'created_at'];
        if (!in_array($column, $allowedColumns)) {
            $column = 'id';
        }

        // Obtener usuarios
        $data['users'] = $this->userModel
            ->where('is_disabled', 0)
            ->orderBy($column, $order)
            ->paginate($perPage);

        // Datos para la vista
        $data['pager'] = $this->userModel->pager;
        $data['column'] = $column;
        $data['order'] = $order;
        $data['perPage'] = $perPage;
        $data['roles'] = $this->roleModel->where('is_disabled', 0)->findAll(); // Roles para dropdowns
---
SELECT *
FROM `users`
WHERE `is_disabled` = 0
ORDER BY `id` ASC
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_disabled` = 0
SELECT *
FROM `roles`
WHERE `is_disabled` = 0