app/Controllers/adminController/muController.php

      ->paginate($data['perPage']);


    $data = [
      'breadcrumbs' => generate_breadcrumbs($segments),
      'view_name' => $title,
      'pager' => $this->userModel->pager,
      'users' => $data['users'],
      'perPage' => $data['perPage'],
      'column' => $data['column'],
      'order' => $data['order'],
      'roles' => $this->roleModel->findAll(),
      'filters' => [
        'username' => $username,
        'email' => $email,
        'role_id' => $roleId,
        'created_at' => $createdAt,
        'showDisabled' => $showDisabled,
      ]
    ];
---
SELECT *
FROM `roles`

  public function create()
  {

    $validationRules = [
      'username' => 'required|min_length[3]|max_length[50]|is_unique[users.username]',
      'email' => 'required|valid_email|is_unique[users.email]',
      'password' => 'required|min_length[8]',
      'role_id' => 'required|in_list[1,2,3]'
    ];

    if (!$this->validate($validationRules)) {
      return redirect()->back()->withInput()->with('error', 'Validation failed. Please check the form.');
    }

    // Datos para insertar en la base de datos
    $data = [
      'username' => $this->request->getPost('username'),
      'email' => $this->request->getPost('email'),
      'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
      'role_id' => $this->request->getPost('role_id'),
      'avatar' => $this->request->getPost('avatar') ?? base_url('assets/media/cats/avatars/default.jpg'),
      'is_disabled' => 0 // Usuario activo por defecto
    ];

    // Insertar el usuario en la base de datos
    $this->userModel->insert($data);
---
INSERT INTO `users` (`username`, `email`, `password`, `role_id`, `avatar`, `is_disabled`, `created_at`, `updated_at`) VALUES ('javier becerra', 'javi@gmail.com', '$2y$10$czJFfFJRrrOp3IUm16Qt4uQGkIetXhix7N2EBqJskfuboEcc.zSSS', '2', 'http://localhost/Catigo/public/assets/media/cats/avatars/default.jpg', 0, '2025-03-09 22:20:28', '2025-03-09 22:20:28')

  public function disable($id)
  {
    $user = $this->userModel->find($id);
    if (!$user) {
      return redirect()->to(base_url('manageUsers') . '?' . $this->buildQueryString($this->request->getGet()))->with('error', 'User not found.');
    }

    $this->userModel->update($id, ['is_disabled' => 1]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '22'
UPDATE `users` SET `is_disabled` = 1, `updated_at` = '2025-03-09 22:21:10'
WHERE `users`.`id` IN ('22')