app/Controllers/EventController.php

  public function fetchEvents()
  {
    $eventModel = new EventModel();
    $eventsData = $eventModel->where('DELETION_DATE', null)->findAll();
---
SELECT *
FROM `event`
WHERE `DELETION_DATE` IS NULL