app/Controllers/EventController.php

SELECT *
FROM `event`
---
  public function fetchEvents()
  {
    $eventModel = new EventModel();
    $events = $eventModel->findAll();