app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function userList()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();